In [1]:
import numpy as np
import pandas as pd

Pandas 객체의 indexing은 python 배열과 달리 정수일 필요는 없음. 다양한 형태의 indexing이 가능.

In [3]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [14]:
obj[['b', 'a', 'd']]
#obj[[1, 0, 3]]

b    5.0
a    0.0
d    3.0
dtype: float64

In [8]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

레이블을 사용한 index slicing의 경우 python과 달리 endpoint를 포함. 숫자 index slicing의 경우 endpoint 제외.

In [11]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [17]:
obj[1:3]

b    5.0
c    5.0
dtype: float64

DataFrame 객체의 경우 indexing을 통해 한 개 이상의 column 값을 가져올 수 있음.

In [18]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

2개 이상 컬럼을 선택할 경우 대괄호('[ ]')로 묶어 리스트로 표시해야 함.

In [21]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

정수 slicing으로 행을 선택할 경우 endpoint는 제외. boolean 배열로도 행을 선택할 수 있음.

In [22]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [23]:
data[data['three']>5] #컬럼 'three'의 값을 기준으로 행을 선택

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
data < 5 #Boolean DataFrame을 생성하여 True인 항목만 선택

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [26]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

 loc과 iloc 으로 선택

In [27]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

loc은 이름으로 선택할 때, iloc을 정수 index로 선택할 때 사용

In [42]:
data.loc['Colorado', ['two', 'three']]
#data.iloc[1, [1,2]]
#data.iat[1, 1] #배열 인덱스는 사용할 수 없음
#data.iat[1, 2]

two      5
three    6
Name: Colorado, dtype: int32

In [9]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [10]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [11]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

loc, iloc은 slicing 등 다양한 indexing도 사용 가능

In [43]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [44]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

필터링을 통해 선택된 항목들에 대해 다시 조건식을 적용할 수 있음. 아래 셀에 한 줄짜리 코드를 두 줄로 나눈 코드를 보면 적용 과정을 쉽게 이해할 수 있음. 대개 한 줄짜리 코드보다는 디버깅이 쉽도록 두 줄로 나눠 작성.

In [14]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [50]:
tmp_df = data.iloc[:,:3]
tmp_df[tmp_df.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14